{"format": "graph-model", "generatedBy": "2.18.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"user_idx:0": {"name": "user_idx:0", "dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "-1"}]}}, "item_idx:0": {"name": "item_idx:0", "dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "-1"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/functional_1/user_emb_1/GatherV2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/user_emb_1/Less/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/user_emb_1/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/user_emb_1/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/flatten_1/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/dot_1/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/item_emb_1/GatherV2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "239"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/item_emb_1/Less/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/item_emb_1/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/item_emb_1/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/flatten_1_2/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/dot_1/ExpandDims_1/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/user_bias_1/GatherV2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/user_bias_1/Less/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/user_bias_1/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/user_bias_1/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/flatten_2_1/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/item_bias_1/GatherV2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "239"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/item_bias_1/Less/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/item_bias_1/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/item_bias_1/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/flatten_3_1/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "item_idx", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "user_idx", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/item_emb_1/Less", "op": "Less", "input": ["item_idx", "StatefulPartitionedCall/functional_1/item_emb_1/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/item_emb_1/add", "op": "AddV2", "input": ["item_idx", "StatefulPartitionedCall/functional_1/item_emb_1/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/item_bias_1/Less", "op": "Less", "input": ["item_idx", "StatefulPartitionedCall/functional_1/item_bias_1/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/item_bias_1/add", "op": "AddV2", "input": ["item_idx", "StatefulPartitionedCall/functional_1/item_bias_1/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/user_emb_1/Less", "op": "Less", "input": ["user_idx", "StatefulPartitionedCall/functional_1/user_emb_1/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/user_emb_1/add", "op": "AddV2", "input": ["user_idx", "StatefulPartitionedCall/functional_1/user_emb_1/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/user_bias_1/Less", "op": "Less", "input": ["user_idx", "StatefulPartitionedCall/functional_1/user_bias_1/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/user_bias_1/add", "op": "AddV2", "input": ["user_idx", "StatefulPartitionedCall/functional_1/user_bias_1/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/item_emb_1/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/functional_1/item_emb_1/Less", "StatefulPartitionedCall/functional_1/item_emb_1/add", "item_idx"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/item_bias_1/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/functional_1/item_bias_1/Less", "StatefulPartitionedCall/functional_1/item_bias_1/add", "item_idx"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/user_emb_1/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/functional_1/user_emb_1/Less", "StatefulPartitionedCall/functional_1/user_emb_1/add", "user_idx"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/user_bias_1/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/functional_1/user_bias_1/Less", "StatefulPartitionedCall/functional_1/user_bias_1/add", "user_idx"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/item_emb_1/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/functional_1/item_emb_1/GatherV2/ReadVariableOp", "StatefulPartitionedCall/functional_1/item_emb_1/SelectV2", "StatefulPartitionedCall/functional_1/item_emb_1/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_1/item_bias_1/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/functional_1/item_bias_1/GatherV2/ReadVariableOp", "StatefulPartitionedCall/functional_1/item_bias_1/SelectV2", "StatefulPartitionedCall/functional_1/item_bias_1/GatherV2/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_1/user_emb_1/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/functional_1/user_emb_1/GatherV2/ReadVariableOp", "StatefulPartitionedCall/functional_1/user_emb_1/SelectV2", "StatefulPartitionedCall/functional_1/user_emb_1/GatherV2/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_1/user_bias_1/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/functional_1/user_bias_1/GatherV2/ReadVariableOp", "StatefulPartitionedCall/functional_1/user_bias_1/SelectV2", "StatefulPartitionedCall/functional_1/user_bias_1/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_1/flatten_1_2/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_1/item_emb_1/GatherV2", "StatefulPartitionedCall/functional_1/flatten_1_2/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/flatten_3_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_1/item_bias_1/GatherV2", "StatefulPartitionedCall/functional_1/flatten_3_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/flatten_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_1/user_emb_1/GatherV2", "StatefulPartitionedCall/functional_1/flatten_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/flatten_2_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_1/user_bias_1/GatherV2", "StatefulPartitionedCall/functional_1/flatten_2_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/dot_1/ExpandDims_1", "op": "ExpandDims", "input": ["StatefulPartitionedCall/functional_1/flatten_1_2/Reshape", "StatefulPartitionedCall/functional_1/dot_1/ExpandDims_1/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/dot_1/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/functional_1/flatten_1/Reshape", "StatefulPartitionedCall/functional_1/dot_1/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/dot_1/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/functional_1/dot_1/ExpandDims", "StatefulPartitionedCall/functional_1/dot_1/ExpandDims_1"], "attr": {"grad_y": {"b": false}, "adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_x": {"b": false}, "adj_y": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1/dot_1/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/functional_1/dot_1/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1"]}}}}, {"name": "StatefulPartitionedCall/functional_1/add_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/dot_1/Squeeze", "StatefulPartitionedCall/functional_1/flatten_2_1/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/add_1/Add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/add_1/Add", "StatefulPartitionedCall/functional_1/flatten_3_1/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/functional_1/add_1/Add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1994}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/functional_1/user_emb_1/GatherV2/ReadVariableOp", "shape": [100, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/user_emb_1/Less/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/user_emb_1/strided_slice", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/user_emb_1/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/flatten_1/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/dot_1/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/item_emb_1/GatherV2/ReadVariableOp", "shape": [239, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/item_emb_1/Less/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/item_emb_1/strided_slice", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/item_emb_1/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/flatten_1_2/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/dot_1/ExpandDims_1/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/user_bias_1/GatherV2/ReadVariableOp", "shape": [100, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/user_bias_1/Less/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/user_bias_1/strided_slice", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/user_bias_1/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/flatten_2_1/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/item_bias_1/GatherV2/ReadVariableOp", "shape": [239, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/item_bias_1/Less/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/item_bias_1/strided_slice", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/item_bias_1/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/flatten_3_1/Reshape/shape", "shape": [2], "dtype": "int32"}]}]}